; domain
(define (domain furniture-assembly)
	(:requirements :strips :typing)
	(:types
		tool tool-part - object
		table-top table-leg - tool
		handle-part action-part - tool-part
		gripper
	)

	(:predicates
		(on ?t1 - tool ?t2 - tool)
		(on-floor ?t - tool)
		(clear ?t - tool)
		(empty ?g - gripper)
		(in-hand ?g - gripper ?t - tool)
		(screwed-into ?t - tool ?s - tool)
		(part-of ?tp - tool-part ?t - tool)
		(affords-picking ?tp - handle-part)
		(affords-screwing ?tp - action-part)
		(affords-hammering ?tp - action-part)
		(affords-turning-on ?tp - action-part)
		(affords-turning-off ?tp - action-part)
		(affords-placing ?t - tool)
		(affords-screwing-into ?s - tool ?tp - tool-part ?t - tool)
	)

	(:action pick-up-from-tool
		:parameters (?g - gripper ?tp - handle-part ?t - tool ?s - tool)
		:precondition (and (clear ?t) (empty ?g) (on ?t ?s) (part-of ?tp ?t) (affords-picking ?tp))
		:effect (and (in-hand ?g ?t) (clear ?s) (not (clear ?t)) (not (empty ?g)) (not (on ?t ?s)))
	)

	(:action pick-up-from-floor
		:parameters (?g - gripper ?tp - handle-part ?t - tool)
		:precondition (and (clear ?t) (empty ?g) (on-floor ?t) (part-of ?tp ?t) (affords-picking ?tp))
		:effect (and (in-hand ?g ?t) (not (clear ?t)) (not (empty ?g)) (not (on-floor ?t)))
	)

	(:action put-on-floor
		:parameters (?g - gripper ?t - tool)
		:precondition (and (in-hand ?g ?t) (affords-placing ?t))
		:effect (and (on-floor ?t) (clear ?t) (empty ?g) (not (in-hand ?g ?t)))
	)

	(:action screw-into
		:parameters (?g - gripper ?tp - action-part ?tl - tool ?th - tool-part ?tt - tool)
		:precondition (and (in-hand ?g ?tl) (part-of ?tp ?tl) (affords-screwing ?tp) (part-of ?th ?tt) (affords-screwing-into ?tl ?th ?tt))
		:effect (and (screwed-into ?tl ?tt) (clear ?tl) (empty ?g) (not (in-hand ?g ?tl)))
	)
)

; problem
(define (problem table-assembly-full)
	(:domain furniture-assembly)

	(:objects
		table-leg1 table-leg2 table-leg3 table-leg4 - table-leg
		table-lack-top - table-top
		table-leg1-base table-leg2-base table-leg3-base table-leg4-base - handle-part
		table-leg1-screw table-leg2-screw table-leg3-screw table-leg4-screw - action-part
		table-lack-top-hole1 table-lack-top-hole2 table-lack-top-hole3 table-lack-top-hole4 - tool-part
		robot-gripper - gripper
	)

	(:init
		(on-floor table-leg1)
		(on-floor table-leg2)
		(on-floor table-leg3)
		(on-floor table-leg4)
		(on-floor table-lack-top)

		(clear table-leg1)
		(clear table-leg2)
		(clear table-leg3)
		(clear table-leg4)

		(empty robot-gripper)

		(part-of table-leg1-base table-leg1)
		(part-of table-leg1-screw table-leg1)
		(part-of table-leg2-base table-leg2)
		(part-of table-leg2-screw table-leg2)
		(part-of table-leg3-base table-leg3)
		(part-of table-leg3-screw table-leg3)
		(part-of table-leg4-base table-leg4)
		(part-of table-leg4-screw table-leg4)
		(part-of table-lack-top-hole1 table-lack-top)
		(part-of table-lack-top-hole2 table-lack-top)
		(part-of table-lack-top-hole3 table-lack-top)
		(part-of table-lack-top-hole4 table-lack-top)

		(affords-picking table-leg1-base)
		(affords-picking table-leg2-base)
		(affords-picking table-leg3-base)
		(affords-picking table-leg4-base)
		(affords-screwing table-leg1-screw)
		(affords-screwing table-leg2-screw)
		(affords-screwing table-leg3-screw)
		(affords-screwing table-leg4-screw)
		(affords-screwing-into table-leg1 table-lack-top-hole1 table-lack-top)
		(affords-screwing-into table-leg2 table-lack-top-hole2 table-lack-top)
		(affords-screwing-into table-leg3 table-lack-top-hole3 table-lack-top)
		(affords-screwing-into table-leg4 table-lack-top-hole4 table-lack-top)
	)

	(:goal (and (screwed-into table-leg1 table-lack-top)
				(screwed-into table-leg2 table-lack-top)
				(screwed-into table-leg3 table-lack-top)
				(screwed-into table-leg4 table-lack-top)
		   	)
	)
)

; plan
1. (pick-up-from-floor robot-gripper table-leg2-base table-leg2)
   deleted: (clear table-leg2) (empty robot-gripper) (on-floor table-leg2)
   added: (in-hand robot-gripper table-leg2)
   goals met: 0 of 4
2. (screw-into robot-gripper table-leg2-screw table-leg2 table-lack-top-hole2 table-lack-top)
   deleted: (in-hand robot-gripper table-leg2)
   added: (screwed-into table-leg2 table-lack-top) (clear table-leg2) (empty robot-gripper)
   goals met: 1 of 4
3. (pick-up-from-floor robot-gripper table-leg1-base table-leg1)
   deleted: (clear table-leg1) (empty robot-gripper) (on-floor table-leg1)
   added: (in-hand robot-gripper table-leg1)
   goals met: 1 of 4
4. (screw-into robot-gripper table-leg1-screw table-leg1 table-lack-top-hole1 table-lack-top)
   deleted: (in-hand robot-gripper table-leg1)
   added: (screwed-into table-leg1 table-lack-top) (clear table-leg1) (empty robot-gripper)
   goals met: 2 of 4
5. (pick-up-from-floor robot-gripper table-leg3-base table-leg3)
   deleted: (clear table-leg3) (empty robot-gripper) (on-floor table-leg3)
   added: (in-hand robot-gripper table-leg3)
   goals met: 2 of 4
6. (screw-into robot-gripper table-leg3-screw table-leg3 table-lack-top-hole3 table-lack-top)
   deleted: (in-hand robot-gripper table-leg3)
   added: (screwed-into table-leg3 table-lack-top) (clear table-leg3) (empty robot-gripper)
   goals met: 3 of 4
7. (pick-up-from-floor robot-gripper table-leg4-base table-leg4)
   deleted: (clear table-leg4) (empty robot-gripper) (on-floor table-leg4)
   added: (in-hand robot-gripper table-leg4)
   goals met: 3 of 4
8. (screw-into robot-gripper table-leg4-screw table-leg4 table-lack-top-hole4 table-lack-top)
   deleted: (in-hand robot-gripper table-leg4)
   added: (screwed-into table-leg4 table-lack-top) (clear table-leg4) (empty robot-gripper)
   goals met: 4 of 4
